avrdudes/avr-libc/include/avr/ioavr64db48.h
/* OPAMP.OP0INMUX  bit masks and bit positions */
#define OPAMP_MUXPOS_gm  0x07  /* Positive Input Multiplexer group mask. */
#define OPAMP_MUXPOS_gp  0  /* Positive Input Multiplexer group position. */
#define OPAMP_MUXPOS_0_bm  (1<<0)  /* Positive Input Multiplexer bit 0 mask. */
#define OPAMP_MUXPOS_0_bp  0  /* Positive Input Multiplexer bit 0 position. */
#define OPAMP_MUXPOS_1_bm  (1<<1)  /* Positive Input Multiplexer bit 1 mask. */
#define OPAMP_MUXPOS_1_bp  1  /* Positive Input Multiplexer bit 1 position. */
#define OPAMP_MUXPOS_2_bm  (1<<2)  /* Positive Input Multiplexer bit 2 mask. */
#define OPAMP_MUXPOS_2_bp  2  /* Positive Input Multiplexer bit 2 position. */
#define OPAMP_MUXNEG_gm  0x70  /* Negative Input Multiplexer group mask. */
#define OPAMP_MUXNEG_gp  4  /* Negative Input Multiplexer group position. */
#define OPAMP_MUXNEG_0_bm  (1<<4)  /* Negative Input Multiplexer bit 0 mask. */
#define OPAMP_MUXNEG_0_bp  4  /* Negative Input Multiplexer bit 0 position. */
#define OPAMP_MUXNEG_1_bm  (1<<5)  /* Negative Input Multiplexer bit 1 mask. */
#define OPAMP_MUXNEG_1_bp  5  /* Negative Input Multiplexer bit 1 position. */
#define OPAMP_MUXNEG_2_bm  (1<<6)  /* Negative Input Multiplexer bit 2 mask. */
#define OPAMP_MUXNEG_2_bp  6  /* Negative Input Multiplexer bit 2 position. */

/* OPAMP.OP0SETTLE  bit masks and bit positions */
#define OPAMP_SETTLE_gm  0x7F  /* Settle Time group mask. */
#define OPAMP_SETTLE_gp  0  /* Settle Time group position. */
#define OPAMP_SETTLE_0_bm  (1<<0)  /* Settle Time bit 0 mask. */
#define OPAMP_SETTLE_0_bp  0  /* Settle Time bit 0 position. */
#define OPAMP_SETTLE_1_bm  (1<<1)  /* Settle Time bit 1 mask. */
#define OPAMP_SETTLE_1_bp  1  /* Settle Time bit 1 position. */
#define OPAMP_SETTLE_2_bm  (1<<2)  /* Settle Time bit 2 mask. */
#define OPAMP_SETTLE_2_bp  2  /* Settle Time bit 2 position. */
#define OPAMP_SETTLE_3_bm  (1<<3)  /* Settle Time bit 3 mask. */
#define OPAMP_SETTLE_3_bp  3  /* Settle Time bit 3 position. */
#define OPAMP_SETTLE_4_bm  (1<<4)  /* Settle Time bit 4 mask. */
#define OPAMP_SETTLE_4_bp  4  /* Settle Time bit 4 position. */
#define OPAMP_SETTLE_5_bm  (1<<5)  /* Settle Time bit 5 mask. */
#define OPAMP_SETTLE_5_bp  5  /* Settle Time bit 5 position. */
#define OPAMP_SETTLE_6_bm  (1<<6)  /* Settle Time bit 6 mask. */
#define OPAMP_SETTLE_6_bp  6  /* Settle Time bit 6 position. */

/* OPAMP.OP0CAL  bit masks and bit positions */
#define OPAMP_CAL_gm  0xFF  /* Calibration (for input offset voltage) group mask. */
#define OPAMP_CAL_gp  0  /* Calibration (for input offset voltage) group position. */
#define OPAMP_CAL_0_bm  (1<<0)  /* Calibration (for input offset voltage) bit 0 mask. */
#define OPAMP_CAL_0_bp  0  /* Calibration (for input offset voltage) bit 0 position. */
#define OPAMP_CAL_1_bm  (1<<1)  /* Calibration (for input offset voltage) bit 1 mask. */
#define OPAMP_CAL_1_bp  1  /* Calibration (for input offset voltage) bit 1 position. */
#define OPAMP_CAL_2_bm  (1<<2)  /* Calibration (for input offset voltage) bit 2 mask. */
#define OPAMP_CAL_2_bp  2  /* Calibration (for input offset voltage) bit 2 position. */
#define OPAMP_CAL_3_bm  (1<<3)  /* Calibration (for input offset voltage) bit 3 mask. */
#define OPAMP_CAL_3_bp  3  /* Calibration (for input offset voltage) bit 3 position. */
#define OPAMP_CAL_4_bm  (1<<4)  /* Calibration (for input offset voltage) bit 4 mask. */
#define OPAMP_CAL_4_bp  4  /* Calibration (for input offset voltage) bit 4 position. */
#define OPAMP_CAL_5_bm  (1<<5)  /* Calibration (for input offset voltage) bit 5 mask. */
#define OPAMP_CAL_5_bp  5  /* Calibration (for input offset voltage) bit 5 position. */
#define OPAMP_CAL_6_bm  (1<<6)  /* Calibration (for input offset voltage) bit 6 mask. */
#define OPAMP_CAL_6_bp  6  /* Calibration (for input offset voltage) bit 6 position. */
#define OPAMP_CAL_7_bm  (1<<7)  /* Calibration (for input offset voltage) bit 7 mask. */
#define OPAMP_CAL_7_bp  7  /* Calibration (for input offset voltage) bit 7 position. */

/* OPAMP.OP1CTRLA  bit masks and bit positions */
/* OPAMP_ALWAYSON  is already defined. */
/* OPAMP_EVENTEN  is already defined. */
/* OPAMP_OUTMODE  is already defined. */
/* OPAMP_RUNSTBY  is already defined. */

/* OPAMP.OP1STATUS  bit masks and bit positions */
/* OPAMP_SETTLED  is already defined. */

/* OPAMP.OP1RESMUX  bit masks and bit positions */
/* OPAMP_MUXTOP  is already defined. */
/* OPAMP_MUXBOT  is already defined. */
/* OPAMP_MUXWIP  is already defined. */

/* OPAMP.OP1INMUX  bit masks and bit positions */
/* OPAMP_MUXPOS  is already defined. */
/* OPAMP_MUXNEG  is already defined. */

/* OPAMP.OP1SETTLE  bit masks and bit positions */
/* OPAMP_SETTLE  is already defined. */

/* OPAMP.OP1CAL  bit masks and bit positions */
/* OPAMP_CAL  is already defined. */

/* OPAMP.OP2CTRLA  bit masks and bit positions */
/* OPAMP_ALWAYSON  is already defined. */
/* OPAMP_EVENTEN  is already defined. */
/* OPAMP_OUTMODE  is already defined. */
/* OPAMP_RUNSTBY  is already defined. */

/* OPAMP.OP2STATUS  bit masks and bit positions */
/* OPAMP_SETTLED  is already defined. */

/* OPAMP.OP2RESMUX  bit masks and bit positions */
/* OPAMP_MUXTOP  is already defined. */
/* OPAMP_MUXBOT  is already defined. */
/* OPAMP_MUXWIP  is already defined. */

/* OPAMP.OP2INMUX  bit masks and bit positions */
/* OPAMP_MUXPOS  is already defined. */
/* OPAMP_MUXNEG  is already defined. */

/* OPAMP.OP2SETTLE  bit masks and bit positions */
/* OPAMP_SETTLE  is already defined. */

/* OPAMP.OP2CAL  bit masks and bit positions */
/* OPAMP_CAL  is already defined. */


/* PORT - I/O Ports */
/* PORT.INTFLAGS  bit masks and bit positions */
#define PORT_INT_gm  0xFF  /* Pin Interrupt Flag group mask. */
#define PORT_INT_gp  0  /* Pin Interrupt Flag group position. */
#define PORT_INT_0_bm  (1<<0)  /* Pin Interrupt Flag bit 0 mask. */
#define PORT_INT_0_bp  0  /* Pin Interrupt Flag bit 0 position. */
#define PORT_INT0_bm  PORT_INT_0_bm  /* This define is deprecated and should not be used */
#define PORT_INT0_bp  PORT_INT_0_bp  /* This define is deprecated and should not be used */
#define PORT_INT_1_bm  (1<<1)  /* Pin Interrupt Flag bit 1 mask. */
#define PORT_INT_1_bp  1  /* Pin Interrupt Flag bit 1 position. */
#define PORT_INT1_bm  PORT_INT_1_bm  /* This define is deprecated and should not be used */
#define PORT_INT1_bp  PORT_INT_1_bp  /* This define is deprecated and should not be used */
#define PORT_INT_2_bm  (1<<2)  /* Pin Interrupt Flag bit 2 mask. */
#define PORT_INT_2_bp  2  /* Pin Interrupt Flag bit 2 position. */
#define PORT_INT2_bm  PORT_INT_2_bm  /* This define is deprecated and should not be used */
#define PORT_INT2_bp  PORT_INT_2_bp  /* This define is deprecated and should not be used */
#define PORT_INT_3_bm  (1<<3)  /* Pin Interrupt Flag bit 3 mask. */
#define PORT_INT_3_bp  3  /* Pin Interrupt Flag bit 3 position. */
#define PORT_INT3_bm  PORT_INT_3_bm  /* This define is deprecated and should not be used */
#define PORT_INT3_bp  PORT_INT_3_bp  /* This define is deprecated and should not be used */
#define PORT_INT_4_bm  (1<<4)  /* Pin Interrupt Flag bit 4 mask. */
#define PORT_INT_4_bp  4  /* Pin Interrupt Flag bit 4 position. */
#define PORT_INT4_bm  PORT_INT_4_bm  /* This define is deprecated and should not be used */
#define PORT_INT4_bp  PORT_INT_4_bp  /* This define is deprecated and should not be used */
#define PORT_INT_5_bm  (1<<5)  /* Pin Interrupt Flag bit 5 mask. */
#define PORT_INT_5_bp  5  /* Pin Interrupt Flag bit 5 position. */
#define PORT_INT5_bm  PORT_INT_5_bm  /* This define is deprecated and should not be used */
#define PORT_INT5_bp  PORT_INT_5_bp  /* This define is deprecated and should not be used */
#define PORT_INT_6_bm  (1<<6)  /* Pin Interrupt Flag bit 6 mask. */
#define PORT_INT_6_bp  6  /* Pin Interrupt Flag bit 6 position. */
#define PORT_INT6_bm  PORT_INT_6_bm  /* This define is deprecated and should not be used */
#define PORT_INT6_bp  PORT_INT_6_bp  /* This define is deprecated and should not be used */
#define PORT_INT_7_bm  (1<<7)  /* Pin Interrupt Flag bit 7 mask. */
#define PORT_INT_7_bp  7  /* Pin Interrupt Flag bit 7 position. */
#define PORT_INT7_bm  PORT_INT_7_bm  /* This define is deprecated and should not be used */
#define PORT_INT7_bp  PORT_INT_7_bp  /* This define is deprecated and should not be used */

