avrdudes/avr-libc/include/avr/ioavr64db48.h
/* TCA0 Signals select bit group values */
typedef enum PORTMUX_TCA0_VALUES_enum
{
    PORTMUX_TCA0_PORTA_gv          = 0x00,  /* WOn: PA0, PA1, PA2, PA3, PA4, PA5 */
    PORTMUX_TCA0_PORTB_gv          = 0x01,  /* WOn: PB0, PB1, PB2, PB3, PB4, PB5 */
    PORTMUX_TCA0_PORTC_gv          = 0x02,  /* WOn: PC0, PC1, PC2, PC3, PC4, PC5 */
    PORTMUX_TCA0_PORTD_gv          = 0x03,  /* WOn: PD0, PD1, PD2, PD3, PD4, PD5 */
    PORTMUX_TCA0_PORTE_gv          = 0x04,  /* WOn: PE0, PE1, PE2, PE3, -, - */
    PORTMUX_TCA0_PORTF_gv          = 0x05   /* WOn: PF0, PF1, PF2, PF3, PF4, PF5 */
} PORTMUX_TCA0_values_t;

/* TCA0 Signals select bit group configurations*/
typedef enum PORTMUX_TCA0_enum
{
    PORTMUX_TCA0_PORTA_gc          = (PORTMUX_TCA0_PORTA_gv << PORTMUX_TCA0_gp),  /* WOn: PA0, PA1, PA2, PA3, PA4, PA5 */
    PORTMUX_TCA0_PORTB_gc          = (PORTMUX_TCA0_PORTB_gv << PORTMUX_TCA0_gp),  /* WOn: PB0, PB1, PB2, PB3, PB4, PB5 */
    PORTMUX_TCA0_PORTC_gc          = (PORTMUX_TCA0_PORTC_gv << PORTMUX_TCA0_gp),  /* WOn: PC0, PC1, PC2, PC3, PC4, PC5 */
    PORTMUX_TCA0_PORTD_gc          = (PORTMUX_TCA0_PORTD_gv << PORTMUX_TCA0_gp),  /* WOn: PD0, PD1, PD2, PD3, PD4, PD5 */
    PORTMUX_TCA0_PORTE_gc          = (PORTMUX_TCA0_PORTE_gv << PORTMUX_TCA0_gp),  /* WOn: PE0, PE1, PE2, PE3, -, - */
    PORTMUX_TCA0_PORTF_gc          = (PORTMUX_TCA0_PORTF_gv << PORTMUX_TCA0_gp)   /* WOn: PF0, PF1, PF2, PF3, PF4, PF5 */
} PORTMUX_TCA0_t;

/* TCA1 Signals select bit group values */
typedef enum PORTMUX_TCA1_VALUES_enum
{
    PORTMUX_TCA1_PORTB_gv          = 0x00,  /* WOn: PB0, PB1, PB2, PB3, PB4, PB5 */
    PORTMUX_TCA1_PORTC_gv          = 0x01   /* WOn: PC4, PC5, PC6 */
} PORTMUX_TCA1_values_t;

/* TCA1 Signals select bit group configurations*/
typedef enum PORTMUX_TCA1_enum
{
    PORTMUX_TCA1_PORTB_gc          = (PORTMUX_TCA1_PORTB_gv << PORTMUX_TCA1_gp),  /* WOn: PB0, PB1, PB2, PB3, PB4, PB5 */
    PORTMUX_TCA1_PORTC_gc          = (PORTMUX_TCA1_PORTC_gv << PORTMUX_TCA1_gp)   /* WOn: PC4, PC5, PC6 */
} PORTMUX_TCA1_t;

/* TCB0 Output select bit group values */
typedef enum PORTMUX_TCB0_VALUES_enum
{
    PORTMUX_TCB0_DEFAULT_gv        = 0x00,  /* WO: PA2 */
    PORTMUX_TCB0_ALT1_gv           = 0x01   /* WO: PF4 */
} PORTMUX_TCB0_values_t;

/* TCB0 Output select bit group configurations*/
typedef enum PORTMUX_TCB0_enum
{
    PORTMUX_TCB0_DEFAULT_gc        = (PORTMUX_TCB0_DEFAULT_gv << PORTMUX_TCB0_bp),  /* WO: PA2 */
    PORTMUX_TCB0_ALT1_gc           = (PORTMUX_TCB0_ALT1_gv << PORTMUX_TCB0_bp)   /* WO: PF4 */
} PORTMUX_TCB0_t;

/* TCB1 Output select bit group values */
typedef enum PORTMUX_TCB1_VALUES_enum
{
    PORTMUX_TCB1_DEFAULT_gv        = 0x00,  /* WO: PA3 */
    PORTMUX_TCB1_ALT1_gv           = 0x01   /* WO: PF5 */
} PORTMUX_TCB1_values_t;

/* TCB1 Output select bit group configurations*/
typedef enum PORTMUX_TCB1_enum
{
    PORTMUX_TCB1_DEFAULT_gc        = (PORTMUX_TCB1_DEFAULT_gv << PORTMUX_TCB1_bp),  /* WO: PA3 */
    PORTMUX_TCB1_ALT1_gc           = (PORTMUX_TCB1_ALT1_gv << PORTMUX_TCB1_bp)   /* WO: PF5 */
} PORTMUX_TCB1_t;

/* TCB2 Output select bit group values */
typedef enum PORTMUX_TCB2_VALUES_enum
{
    PORTMUX_TCB2_DEFAULT_gv        = 0x00,  /* WO: PC0 */
    PORTMUX_TCB2_ALT1_gv           = 0x01   /* WO: PB4 */
} PORTMUX_TCB2_values_t;

/* TCB2 Output select bit group configurations*/
typedef enum PORTMUX_TCB2_enum
{
    PORTMUX_TCB2_DEFAULT_gc        = (PORTMUX_TCB2_DEFAULT_gv << PORTMUX_TCB2_bp),  /* WO: PC0 */
    PORTMUX_TCB2_ALT1_gc           = (PORTMUX_TCB2_ALT1_gv << PORTMUX_TCB2_bp)   /* WO: PB4 */
} PORTMUX_TCB2_t;

/* TCB3 Output select bit group values */
typedef enum PORTMUX_TCB3_VALUES_enum
{
    PORTMUX_TCB3_DEFAULT_gv        = 0x00,  /* WO: PB5 */
    PORTMUX_TCB3_ALT1_gv           = 0x01   /* WO: PC1 */
} PORTMUX_TCB3_values_t;

/* TCB3 Output select bit group configurations*/
typedef enum PORTMUX_TCB3_enum
{
    PORTMUX_TCB3_DEFAULT_gc        = (PORTMUX_TCB3_DEFAULT_gv << PORTMUX_TCB3_bp),  /* WO: PB5 */
    PORTMUX_TCB3_ALT1_gc           = (PORTMUX_TCB3_ALT1_gv << PORTMUX_TCB3_bp)   /* WO: PC1 */
} PORTMUX_TCB3_t;

/* TCD0 Signals select bit group values */
typedef enum PORTMUX_TCD0_VALUES_enum
{
    PORTMUX_TCD0_DEFAULT_gv        = 0x00,  /* WOx: PA4, PA5, PA6, PA7 */
    PORTMUX_TCD0_ALT1_gv           = 0x01,  /* WOx: PB4, PB5, -, - */
    PORTMUX_TCD0_ALT2_gv           = 0x02   /* WOx: PF0, PF1, PF2, PF3 */
} PORTMUX_TCD0_values_t;

/* TCD0 Signals select bit group configurations*/
typedef enum PORTMUX_TCD0_enum
{
    PORTMUX_TCD0_DEFAULT_gc        = (PORTMUX_TCD0_DEFAULT_gv << PORTMUX_TCD0_gp),  /* WOx: PA4, PA5, PA6, PA7 */
    PORTMUX_TCD0_ALT1_gc           = (PORTMUX_TCD0_ALT1_gv << PORTMUX_TCD0_gp),  /* WOx: PB4, PB5, -, - */
    PORTMUX_TCD0_ALT2_gc           = (PORTMUX_TCD0_ALT2_gv << PORTMUX_TCD0_gp)   /* WOx: PF0, PF1, PF2, PF3 */
} PORTMUX_TCD0_t;

/* TWI0 Signals select bit group values */
typedef enum PORTMUX_TWI0_VALUES_enum
{
    PORTMUX_TWI0_DEFAULT_gv        = 0x00,  /* SDA: PA2, SCL: PA3. Dual mode: SDA: PC2, SCL: PC3. */
    PORTMUX_TWI0_ALT1_gv           = 0x01,  /* SDA: PA2, SCL: PA3. Dual mode: SDA: PC6, SCL: PC7. */
    PORTMUX_TWI0_ALT2_gv           = 0x02   /* SDA: PC2, SCL: PC3. Dual mode: SDA: PC6, SCL: PC7. */
} PORTMUX_TWI0_values_t;

/* TWI0 Signals select bit group configurations*/
typedef enum PORTMUX_TWI0_enum
{
    PORTMUX_TWI0_DEFAULT_gc        = (PORTMUX_TWI0_DEFAULT_gv << PORTMUX_TWI0_gp),  /* SDA: PA2, SCL: PA3. Dual mode: SDA: PC2, SCL: PC3. */
    PORTMUX_TWI0_ALT1_gc           = (PORTMUX_TWI0_ALT1_gv << PORTMUX_TWI0_gp),  /* SDA: PA2, SCL: PA3. Dual mode: SDA: PC6, SCL: PC7. */
    PORTMUX_TWI0_ALT2_gc           = (PORTMUX_TWI0_ALT2_gv << PORTMUX_TWI0_gp)   /* SDA: PC2, SCL: PC3. Dual mode: SDA: PC6, SCL: PC7. */
} PORTMUX_TWI0_t;

/* TWI1 Signals select bit group values */
typedef enum PORTMUX_TWI1_VALUES_enum
{
    PORTMUX_TWI1_DEFAULT_gv        = 0x00,  /* SDA: PF2, SCL: PF3. Dual mode: SDA: PB2, SCL: PB3. */
    PORTMUX_TWI1_ALT1_gv           = 0x01,  /* SDA: PF2, SCL: PF3. Dual mode: SDA: -, SCL: -. */
    PORTMUX_TWI1_ALT2_gv           = 0x02   /* SDA: PB2, SCL: PB3. Dual mode: SDA: -, SCL: -. */
} PORTMUX_TWI1_values_t;

/* TWI1 Signals select bit group configurations*/
typedef enum PORTMUX_TWI1_enum
{
    PORTMUX_TWI1_DEFAULT_gc        = (PORTMUX_TWI1_DEFAULT_gv << PORTMUX_TWI1_gp),  /* SDA: PF2, SCL: PF3. Dual mode: SDA: PB2, SCL: PB3. */
    PORTMUX_TWI1_ALT1_gc           = (PORTMUX_TWI1_ALT1_gv << PORTMUX_TWI1_gp),  /* SDA: PF2, SCL: PF3. Dual mode: SDA: -, SCL: -. */
    PORTMUX_TWI1_ALT2_gc           = (PORTMUX_TWI1_ALT2_gv << PORTMUX_TWI1_gp)   /* SDA: PB2, SCL: PB3. Dual mode: SDA: -, SCL: -. */
} PORTMUX_TWI1_t;

